## Generated SDC file "lab7.sdc"

## Copyright (C) 1991-2014 Altera Corporation. All rights reserved.
## Your use of Altera Corporation's design tools, logic functions 
## and other software and tools, and its AMPP partner logic 
## functions, and any output files from any of the foregoing 
## (including device programming or simulation files), and any 
## associated documentation or information are expressly subject 
## to the terms and conditions of the Altera Program License 
## Subscription Agreement, the Altera Quartus II License Agreement,
## the Altera MegaCore Function License Agreement, or other 
## applicable license agreement, including, without limitation, 
## that your use is for the sole purpose of programming logic 
## devices manufactured by Altera and sold by Altera or its 
## authorized distributors.  Please refer to the applicable 
## agreement for further details.


## VENDOR  "Altera"
## PROGRAM "Quartus II"
## VERSION "Version 14.1.0 Build 186 12/03/2014 SJ Web Edition"

## DATE    "Sun Feb 15 03:20:54 2015"

##
## DEVICE  "EP4CE115F29C8"
##


create_clock -name {CLOCK_50} -period 20ns -waveform {0.000 5.000} [get_ports {Clk}]
# Constrain the input I/O path
set_input_delay -clock {CLOCK_50} -max 3 [all_inputs]
set_input_delay -clock {CLOCK_50} -min 2 [all_inputs]
# Constrain the output I/O path
set_output_delay -clock {CLOCK_50} 2 [all_outputs]